package com.stargazerproject.annotation.description;

/** 
 *  @name 线程安全程度
 *  @illustrate 线程安全性的分类方法：根据具体实现类、不可变、线程安全、有条件线程安全、线程兼容和线程对立。
 *  @version 1.0.0
 *  **/
public enum ThreadSafeLevel {
	
	/**
	 * @name 根据具体实现类来确定线程安全程度
	 * @illustrate 根据具体实现类来确定线程安全程度是一个特殊的ThreadSafeLevel，其一般用于非实现类（壳式对象）或者是接口中，
	 *             表示这个方法的实际线程安全程度是由具体的实现类（特征）来确定，不同的实现类可能会有相同或不同的线程安全程度。
	 * **/
	Implementation,

	/**
	 * @name 不可变
	 * @illustrate 不可变的对象一定是线程安全的，并且永远也不需要额外的同步。因为一个不可变的对象只要构建正确，
	 * 			   其外部可见状态永远也不会改变，永远也不会看到它处于不一致的状态。Java 类库中大多数基本数值类如 
	 *             Integer 、 String 和 BigInteger 都是不可变的。
	 * **/
	Immutable,
	
	/**
	 * @name 线程安全
	 * @illustrate 线程安全的对象具有在上面“线程安全”一节中描述的属性 -- 由类的规格说明所规定的约束在对象被多个线程访问时仍然有效，
	 *             不管运行时环境如何排列，线程都不需要任何额外的同步。这种线程安全性保证是很严格的 -- 许多类，如 Hashtable 或者 
	 *             Vector 都不能满足这种严格的定义。
	 * **/
	ThreadSafe,
	
	/**
	 * @name 有条件的线程安全
	 * @illustrate 有条件的线程安全类对于单独的操作可以是线程安全的，但是某些操作序列可能需要外部同步。条件线程安全的最常见的例子是遍历由 
	 *             Hashtable 或者 Vector 或者返回的迭代器 -- 由这些类返回的 fail-fast 迭代器假定在迭代器进行遍历的时候底层集合不会有变化。
	 *             为了保证其他线程不会在遍历的时候改变集合，进行迭代的线程应该确保它是独占性地访问集合以实现遍历的完整性。通常，独占性的访问是由对锁的同步保证的,
	 *             并且类的文档应该说明是哪个锁(通常是对象的内部监视器(intrinsic monitor))。如果对一个有条件线程安全类进行记录，
	 *             那么您应该不仅要记录它是有条件线程安全的，而且还要记录必须防止哪些操作序列的并发访问。用户可以合理地假设其他操作序列不需要任何额外的同步。
	 * **/
	ConditionallyThreadSafe,
	
	/**
	 * @name 线程兼容
	 * @illustrate 线程兼容类不是线程安全的，但是可以通过正确使用同步而在并发环境中安全地使用。这可能意味着用一个 synchronized 块包围每一个方法调用，
	 * 或者创建一个包装器对象，其中每一个方法都是同步的(就像 Collections.synchronizedList()一样)。也可能意味着用 synchronized 块包围某些操作序列。
	 * 为了最大程度地利用线程兼容类，如果所有调用都使用同一个块，那么就不应该要求调用者对该块同步。这样做会使线程兼容的对象作为变量实例包含在其他线程安全的对象中，
	 * 从而可以利用其所有者对象的同步。许多常见的类是线程兼容的，如集合类 ArrayList 和 HashMap 、java.text.SimpleDateFormat 、或者 JDBC 类 Connection 和 ResultSet 。
	 * **/
	ThreadCompatible,
	
	/**
	 * @name 线程对立
	 * @illustrate 线程对立类是那些不管是否调用了外部同步都不能在并发使用时安全地呈现的类。线程对立很少见，当类修改静态数据，而静态数据会影响在其他线程中执行的其他类的行为，
	 *             这时通常会出现线程对立。线程对立类的一个例子是调用System.setOut() 的类。
	 * **/
	ThreadHostile
	
}
